import styles from "./page.module.css";

const PrivacyPolicy = () => {
  return (
    <main className={styles.main}>
      <h1>Политика конфиденциальности</h1>
      <p>
        Настоящая Политика конфиденциальности персональных данных (далее — Политика конфиденциальности) действует в отношении всей информации, которую сайт Uni Food, расположенный на доменном имени unifood.com, может получить о Пользователе во время использования сайта, программ и продуктов.
        <li>1. Определение терминов</li>
        <li>1.1. Сайт — сайт, расположенный в сети Интернет по адресу unifood.com, является учебным проектом Ильи Александровича Ловягина и Романа Сергеевича Сычева. Все авторские права защищены. Услуги, товары и иные цифровые представления на данном сайте не являются офертой. Регистрация аккаунта и получение QR кода карты лояльности не предоставляют возможности использовать их в каких либо местах, кроме настоящего сайта.</li>
        <li>1.2. Администрация сайта не имеет никакого отношения к торговой сети Uni food.</li>
        <li>1.3. Пользователь — лицо, имеющее доступ к сайту, посредством сети Интернет и использующее сайт.</li>
        <li>1.4. Контент — текстовая, графическая, аудио и иная информация.</li>
        <li>1.5. Персональные данные — информация, которую Пользователь предоставляет о себе самостоятельно во время регистрации или в процессе использования сайта.</li>
        <li>1.6. Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</li>
        <li>1.7. Конфиденциальность персональных данных — обязательное для соблюдения Администрацией сайта требование не разглашать персональные данные Пользователя без его согласия.</li>
        <li>1.8. IP-адрес — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</li>
        <li>2. Общие положения</li>
        <li>2.1. Использование сайта Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</li>
        <li>2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта.</li>
        <li>2.3. Настоящая Политика конфиденциальности применяется только к сайту Uni Food. Сайт не контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте Uni Food.</li>
        <li>2.4. Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта.</li>
        <li>3. Предмет политики конфиденциальности</li>
        <li>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации на сайте или при оформлении заказа для использования функционала сайта.</li>
        <li>3.2. Персональные данные, разрешенные к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путем заполнения форм на сайте Uni Food и включают в себя следующую информацию:</li>
        <li>3.2.1. фамилию, имя, отчество Пользователя;</li>
        <li>3.2.2. контактный телефон Пользователя;</li>
        <li>3.2.3. адрес электронной почты (e-mail);</li>
        <li>3.3. Сайт защищает Данные, которые автоматически передаются при посещении страниц:</li>
        <li>— IP адрес;</li>
        <li>— время доступа;</li>
        <li>— реферер (адрес предыдущей страницы).</li>
        <li>3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта, требующим авторизации.</li>
        <li>3.3.2. Сайт собирает статистику об IP-адресах своих посетителей. Данная информация используется для предотвращения, выявления и решения технических проблем.</li>
        <li>3.4. Любая иная персональная информация неоговоренная выше (история браузера, операционная система, и т. д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных пунктом 5.2. настоящей Политики конфиденциальности.</li>
        <li>3.5. Сайт не проверяет достоверность персональных данных, предоставляемых Пользователем сайта.</li>
        <li>4. Цели сбора персональной информации Пользователя</li>
        <li>4.1. Персональные данные Пользователя Администрация сайта может использовать в целях:</li>
        <li>4.2.1. Идентификации Пользователя, зарегистрированного на сайте Uni Food для его дальнейшей авторизации, оформления заказа и других действий.</li>
        <li>4.2.2. Предоставления Пользователю доступа к персонализированным данным сайта.</li>
        <li>4.2.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта, оказания услуг, обработки запросов и заявок от Пользователя.</li>
        <li>4.2.4. Оценки и анализа работы сайта для улучшения качества работы сайта и его функционала.</li>
        <li>4.2.5. Осуществления рекламной деятельности с согласия Пользователя.</li>
        <li>4.2.6. Предоставления доступа Пользователю на сайты или сервисы партнеров с целью получения продуктов, обновлений и услуг.</li>
        <li>5. Способы и сроки обработки персональной информации</li>
        <li>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока с использованием средств автоматизации или без использования таких средств.</li>
        <li>5.2. Пользователь соглашается с тем, что Администрация сайта имеет право передавать персональные данные третьим лицам, в частности, курьерским службам, организациям почтовой связи (в том числе электронной), операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на сайте Uni Food, включая доставку Товара, документации или электронной почты.</li>
        <li>5.3. Персональные данные Пользователя могут быть переданы органам государственной власти по требованию законодательства.</li>
        <li>5.4. В случае утраты или разглашения персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.</li>
        <li>5.5. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</li>
        <li>5.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</li>
        <li>6. Права и обязанности сторон</li>
        <li>6.1. Пользователь имеет право:</li>
        <li>6.1.1. Осуществить контроль над обработкой своих персональных данных.</li>
        <li>6.1.2. Внести изменения в персональные данные.</li>
        <li>6.1.3. Отозвать согласие на обработку персональных данных.</li>
        <li>6.1.4. Запретить обработку персональных данных.</li>
        <li>6.2. Администрация сайта обязана:</li>
        <li>6.2.1. Использовать полученную информацию исключительно в целях, указанных в п. 4 настоящей Политики конфиденциальности.</li>
        <li>6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование или разглашение иными возможностями переданных персональных данных Пользователя, за исключением п. 5.2. настоящей Политики конфиденциальности.</li>
        <li>6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемому для защиты данного рода информации в существующем деловом обороте.</li>
        <li>6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки в случае выявления недостоверных персональных данных или неправомерных действий.</li>
        <li>7. Ответственность сторон</li>
        <li>7.1. Администрация сайта, не исполнившая свои обязанности, несет ответственность за убытки, понесенные Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.</li>
        <li>7.2. В случае утраты или разглашения конфиденциальной информации Администрация сайта не несет ответственности, если данная конфиденциальная информация:</li>
        <li>7.2.1. Стала публичным достоянием до ее утраты или разглашения.</li>
        <li>7.2.2. Была получена от третьей стороны до ее получения Администрацией сайта.</li>
        <li>7.2.3. Была разглашена с согласия Пользователя.</li>
      </p>
    </main>
  )
}

export default PrivacyPolicy